{"data":{"allContentfulAbout":{"edges":[{"node":{"headerText":"Premier local tree service","paragraphText":{"childMarkdownRemark":{"html":"<p>Noah’s Park Tree Care is owned and operated by Noah Chubb-Silverman, a second-generation Reno native. He started his career in Seattle working and learning tree care from some of Seattle’s best arborists. It was then that he learned the fundamental rules of Tree Care: be safe, and do what is best for the tree.</p>\n<p>While attending college he continued to work and study arboriculture during the summer in both Seattle and Reno. After graduating from Western Washington University in 2005 he moved back to Reno and started Noah’s Park Tree Care.</p>\n<p>Since then he has worked hard to make Noah’s Park one of Reno’s premier tree services, capable of handling almost any job. He is also an avid cyclist and the Co-Founder of the Reno Bike Project, a cycling advocacy group here in Reno.</p>","excerpt":"Noah’s Park Tree Care is owned and operated by Noah Chubb-Silverman, a second-generation Reno native. He started his career in Seattle working and learning tree care from some of Seattle’s best arborists. It was then that he learned the fundamental rules of Tree Care: be safe, and do what is best for the tree. While…"}},"blockHeaderText":"Professional and experienced tree care","blockParagraphText":{"childMarkdownRemark":{"html":"<p>Serving the Northern Nevada, we specialize in safe, considerate tree and shrub pruning, removal, trimming, and planting. </p>","excerpt":"Serving the Northern Nevada, we specialize in safe, considerate tree and shrub pruning, removal, trimming, and planting. "}},"blockButtonText":"Our Services","blockButtonDestination":"services"}}]},"allContentfulIdentity":{"edges":[{"node":{"headerText":"Professional and experienced tree care","buttonText":"Get a free quote","buttonDestination":"contact","paragraphText":{"childMarkdownRemark":{"html":"<p>We provide professional and knowledgable arboricultural services for both residential and commercial properties, big and small. We work year-round and specialize in safe, considerate tree and shrub pruning, removal, and planting.</p>","excerpt":"We provide professional and knowledgable arboricultural services for both residential and commercial properties, big and small. We work year-round and specialize in safe, considerate tree and shrub pruning, removal, and planting."}}}}]}},"pageContext":{"limit":20,"skip":0}}